namespace CompileLibrary
{
    //Тип графика
    public enum GraficType
    {
        Grafic, //График
        Grafic0, //График - ступенчатая интерполяция
        Diagramm, //Диаграмма
        Error
    }

    //----------------------------------------------------------------------
    //Способ формирования параметра для ведомости или архива результатов
    public enum ArchiveParamType
    {
        Param, //Параметр
        SubParam, //Подпараметр
        NotSave, //Не сохранять
        Error //Ошибка
    }

    //----------------------------------------------------------------------
    //Типы накопления
    public enum SuperProcess
    {
        Moment, //Мгновенные
        First, //Первое
        Last, //Последнее
        Min, //Минимум
        Max, //Максимум
        Average, //Среднее
        Summ, //Сумма
        None, //Нет накопления
        Error //Не правильно заполненное
    }
}