namespace CompileLibrary
{
    //Тип списка функций, для чего он предназначен
    public enum FunsCheckType
    {
        Calc, //Расчет
        Gen //Генерация
    }

    //----------------------------------------------------------------------
    //Типы массивов
    public enum ArrayType
    {
        Single, // Одно значение
        List, //Список
        DicStrings, //Словарь, индексы - строки
        DicNumbers, //Словарь, индексы - числа
        Error //Ошибка
    }

    //----------------------------------------------------------------------
    //Тип графика
    public enum GraficType
    {
        Grafic, //График
        Grafic0, //График - ступенчатая интерполяция
        Diagramm, //Диаграмма
        Error
    }

    //----------------------------------------------------------------------
    //Способ формирования параметра для ведомости или архива результатов
    public enum ArchiveParamType
    {
        Param, //Параметр
        SubParam, //Подпараметр
        NotSave, //Не сохранять
        Error //Ошибка
    }

    //----------------------------------------------------------------------
    //Типы накопления
    public enum SuperProcess
    {
        Moment, //Мгновенные
        First, //Первое
        Last, //Последнее
        Min, //Минимум
        Max, //Максимум
        Average, //Среднее
        Summ, //Сумма
        None, //Нет накопления
        Error //Не правильно заполненное
    }
}